# GetVertices Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolylineSegments..::..GetVertices Method
PolylineSegments Class See Also
---
Returns an array of vertices of the polyline segments.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<XYZ> GetVertices()
```

Visual Basic
---
```text
Public Function GetVertices As IList(Of XYZ)
```

Visual C++
---
```text
public:
IList<XYZ^>^ GetVertices()
```

# ### Return Value
Array of XYZ points.
# See Also
PolylineSegments Class
Autodesk.Revit.DB Namespace